{"id":482728,"xmlId":"com.intellij.ml.llm","name":"JetBrains AI Assistant","description":"JetBrains AI Assistant provides AI-powered features for software development based on the JetBrains AI Service. The service transparently connects you, as an IDE user, to different large language models (LLMs).\n  With JetBrains AI Assistant, your favorite tools gain new abilities while you are empowered with more information at your fingertips. Free yourself from repetitive tasks and stay in the flow like never before.\n  <br><br>\n  All AI-powered features are context-aware, and this helps JetBrains AI Assistant understand your project. The methods, the containing classes, the usages, and the relevant references from the function bodies, as well as the languages and technologies used in your project will be added to the prompt if it helps provide better results.\n  <br><br>\n\n  <b>AI Chat</b><br>\n  Ask JetBrains AI Assistant your programming questions or request it to iterate on a task. Once you’re happy with the result, use the <i>Insert Snippet at Caret</i> function to put the AI-generated code into the editor or just copy it over.\n  To ask the AI about a specific code fragment, select it in the editor and invoke an action from the <i>AI Actions</i> menu, which is available in the editor’s context menu. You can also use the <i>Alt+Enter</i> shortcut. The <i>New chat using selection</i> action allows you to provide your own prompt or request.\n  <br><br>\n  Additionally, the JetBrains AI Assistant chat can answer questions related to your project without requiring you to copy and paste relevant code fragments. You can now address requests like “Explain the code in the opened file”, “What is the code in MyClass doing?”, “Rewrite MyClass as an abstract class”, “Summarize my local changes”, and much more!\n  <br><br>\n\n  <b>Get errors explained and fixes suggested</b><br>\n  Need to research an error or find a way to implement an algorithm? Now, you can do this without leaving the IDE. JetBrains AI Assistant will explain what an error means, suggest a fix for your particular case, or offer a way to refactor the code.\n  <br><br>\n  It’s not always clear which part of the code was changed by an LLM. To simplify this workflow, we’ve integrated a new diff view directly into LLM code suggestions. Click on See <i>Diff and Apply</i> to open it and decide which parts of the generated code should be applied.\n  <br><br>\n  <b>Commit message generation</b><br>\n  The commit message dialog now has a <i>Generate Commit Message with JetBrains AI Assistant</i> icon. Click it to send the diffs of your changes to the LLM, which will generate a commit message describing your changes.\n  <br><br>\n\n  <b>Code autocompletion</b><br>\n  You asked, and we listened! JetBrains AI Assistant can now autocomplete single lines, entire functions, and even blocks of code in real time based on the project context.\n  The generated code is similar to how you would write code, matching your style and naming conventions. You can press the Tab key to quickly accept the suggestion, or you can reject the suggestion by simply continuing to write your own code.\n  <br><br>\n\n  <b>Documentation generation</b><br>\n  If you need to generate the documentation for a declaration using an LLM, call up the AI Actions menu and select the Write documentation action.\n  <br><br>\n\n  <b>Privacy</b><br>\n  We take data and code security seriously!\n  We strictly follow the <a href=\"https://www.jetbrains.com/legal/docs/terms/jetbrains-ai-service/\">JetBrains AI Terms of Service</a>, so neither we nor our service providers use your datа or code for training any generative AI models.\n  <br><br>\n  <b>With JetBrains AI Assistant, organizations can benefit from:</b><br>\n  <ol>\n    <li><b>The latest advancements in AI technology.</b> With the JetBrains AI Service, you will have access to cutting-edge LLMs not only today but also in the future, without having to do research or switch providers.</li>\n    <li><b>Simple license management.</b> Administrators can enable JetBrains AI Assistant for their organizations on the <a href=\"https://sales.jetbrains.com/hc/en-gb/articles/14753675807506-How-to-enable-AI-Assistant-for-companies\">Administration page</a> in their JetBrains Account.</li>\n    <li><b>Guaranteed code security.</b> JetBrains AI Assistant does not store or disclose your code snippets, irrespective of whether the data originates from public repositories, private repositories, or local files.</li>\n  </ol>\n\n  <b>Supported languages and frameworks</b><br>\n  JetBrains AI Assistant is compatible with a wide range of programming languages, including but not limited to Java, Kotlin, PHP, Python, JavaScript, Ruby, Go, C#, and C++. Drawing from its training on diverse public repositories, it seamlessly operates across a broad spectrum of popular languages, libraries, and frameworks.\n  <br><br>\n\n  Access to the JetBrains AI Service is currently restricted to the territories where the OpenAI service is available. You can check the full list of territories <a href=\"https://www.jetbrains.com/legal/docs/terms/jetbrains-ai/service-territory/?_ga=2.147309559.1562350729.1687771582-330846656.1685715322&amp;_gac=1.116266484.1687789205.Cj0KCQjw7uSkBhDGARIsAMCZNJvz_B1CkVfKFPTcTGpJKp-Kg_iwPFVM8E1nFifZzZUPLnXlKTlw5LEaAvV5EALw_wcB&amp;_gl=1*6ue6uo*_ga*MzMwODQ2NjU2LjE2ODU3MTUzMjI.*_ga_9J976DJZ68*MTY4Nzk2NTY0Mi43MjkuMS4xNjg3OTY1NjQ5LjUzLjAuMA..\">here</a>.\n  <br><br>\n  We value your feedback!\n  You can tell us about your experience via the <i>Share your feedback</i> link in the <i>AI Assistant</i> tool window or by submitting feature requests or bug reports in the <a href=\"https://youtrack.jetbrains.com/issues/LLM\">AI Assistant YouTrack project</a>. Our support engineers are working hard to respond to all questions as soon as possible.\n<h2>Getting started</h2>\nTo enable AI Assistant, open a project in your go-to JetBrains IDE, click the AI icon  on the right-hand toolbar, and follow the instructions that appear.","organization":"JetBrains s.r.o.","tags":["Code Tools","Editor","Code Editing","Miscellaneous","Code Quality","Productivity","Machine Learning","Freemium"],"version":"233.14015.147","dependencies":["Git4Idea","com.intellij.modules.ultimate"],"optionalDependencies":["intellij.devkit.core","org.jetbrains.plugins.go","com.intellij.java","intellij.ml.llm.java","org.jetbrains.kotlin","com.intellij.modules.python","intellij.ml.llm.python","Pythonid","intellij.jupyter","com.intellij.modules.clion","JavaScript","org.jetbrains.android","intellij.platform.ml.embeddings","org.jetbrains.plugins.ruby","com.jetbrains.php","com.jetbrains.performancePlugin","org.intellij.plugins.markdown","intellij.aqua.wi","intellij.aqua.frameworks.core"],"since":"233.14015","until":"233.14015.*","size":6634040,"vendor":"JetBrains","productCode":"AIP"}